# Import and Export : MySQL - Python

## MySQL - Import

In [18]:
#pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [19]:
#libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [21]:
print(pymysql.__version__)

1.4.6

In [49]:
F1 = '/Users/du/dup/analytics/data/'
print(sorted(os.listdir(F1)))

['.DS_Store', 'HRDataset_v14.csv', 'MFGEmployees4.csv', 'VLOOKUP and HLOOKUP.xlsx', 'WA_Fn-UseC_-HR-Employee-Attrition.csv', 'archive.zip', 'attrition.zip', 'attritionData.csv', 'deceptive-opinion.csv', 'hrClustering.csv', 'hrdataset.zip', 'mtcars.csv', 'pdftable.pdf', 'sales_forecasting_data.xlsx', 'stateCodes.csv', 'students1.csv', 'studentsX1.csv', 'studentsX2.xlsx', 'subjectARdata.csv']

In [8]:
folder1 = '/Users/du/dup/analytics/data/'
file1 = "students1.csv"

# Join folder and file name
file_path = os.path.join(folder1, file1)

if os.path.isfile(file_path):
    print(f"✅ File exists: {file_path}")
else:
    print(f"❌ File not found in {folder_path}")

✅ File exists: /Users/du/dup/analytics/data/students1.csv

In [9]:
print(file_path)

/Users/du/dup/analytics/data/students1.csv

In [11]:
df = pd.read_csv(file_path)
df.shape

(30, 6)

In [12]:
df.head()

,id,name,branch,score,exam_date,remarks
0,1,Rick Johnson,Mechanical,63.68,2025-03-30,Average
1,2,Shannon Hall,Electrical,74.35,2024-03-28,Outstanding
2,3,Stephanie Flores,Computer Science,88.97,2024-05-17,Average
3,4,Keith Ferrell,Civil,75.00,2025-06-22,Average
4,5,Corey Allen,Computer Science,63.14,2025-05-17,Needs Improvement

In [14]:
df.dtypes  # dates type NA

id             int64
name          object
branch        object
score        float64
exam_date     object
remarks       object
dtype: object

In [16]:
df['exam_date'] = pd. to_datetime(df['exam_date'], dayfirst=False, errors='coerce')
df.dtypes

id                    int64
name                 object
branch               object
score               float64
exam_date    datetime64[ns]
remarks              object
dtype: object

In [25]:
#user-piuser, pwd-Pass#123, yourdb - students
#engine = create_engine('mysql+pymysql://user:pwd@host:3306/yourdb')
#Replace # with %23 (URL encoding for #):
#engine = create_engine('mysql+pymysql://piuser:Pass#123@localhost:3306/piit')
engine = create_engine('mysql+pymysql://piuser:Pass%23123@localhost:3306/piit')
print(engine)

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [24]:
# check
pd.read_sql('SHOW DATABASES;', engine)

             Database
0  information_schema
1  performance_schema
2                piit

In [ ]:
pd.read_sql('SHOW TABLES;', engine)

In [26]:
df.to_sql('students', engine, if_exists='append', index=False, chunksize=1000, method='multi')

30

In [27]:
pd.read_sql('SHOW TABLES;', engine)

  Tables_in_piit
0      employees
1       students

In [ ]:
 # Students from csv imported in mysql database as students table

## Export from MySQL to csv/excel

In [28]:
# libraries
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [29]:
# Engine - piuser#123
engine = create_engine('mysql+pymysql://piuser:Pass%23123@localhost:3306/piit')
print(engine)

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [30]:
df2 = pd.read_sql("SELECT * FROM students", engine)
df2.shape

(30, 6)

In [32]:
df2.head(2)

   id          name      branch  score  exam_date      remarks
0   1  Rick Johnson  Mechanical  63.68 2025-03-30      Average
1   2  Shannon Hall  Electrical  74.35 2024-03-28  Outstanding

In [33]:
csvfile = '/Users/du/dup/analytics/data/studentsX1.csv'
xlsfile =  '/Users/du/dup/analytics/data/studentsX2.xlsx'

In [43]:
print(os.listdir('/Users/du/dup/analytics/data'))

['studentsX1.csv', 'MFGEmployees4.csv', '.DS_Store', 'students1.csv', 'pdftable.pdf', 'attritionData.csv', 'WA_Fn-UseC_-HR-Employee-Attrition.csv', 'sales_forecasting_data.xlsx', 'hrClustering.csv', 'stateCodes.csv', 'mtcars.csv', 'VLOOKUP and HLOOKUP.xlsx', 'archive.zip', 'attrition.zip', 'HRDataset_v14.csv', 'hrdataset.zip', 'deceptive-opinion.csv', 'subjectARdata.csv']

In [38]:
df2.to_csv(csvfile, index=False)

In [45]:
df2.to_excel(xlsfile, index=False)

In [52]:
print(sorted(os.listdir('/Users/du/dup/analytics/data'), key=str.lower))

['.DS_Store', 'archive.zip', 'attrition.zip', 'attritionData.csv', 'deceptive-opinion.csv', 'hrClustering.csv', 'hrdataset.zip', 'HRDataset_v14.csv', 'MFGEmployees4.csv', 'mtcars.csv', 'pdftable.pdf', 'sales_forecasting_data.xlsx', 'stateCodes.csv', 'students1.csv', 'studentsX1.csv', 'studentsX2.xlsx', 'subjectARdata.csv', 'VLOOKUP and HLOOKUP.xlsx', 'WA_Fn-UseC_-HR-Employee-Attrition.csv']

In [50]:
# import data and check
df2b = pd.read_csv(csvfile)
df2b.shape

(30, 6)

In [51]:
df2c = pd.read_excel(xlsfile)
df2c.shape

(30, 6)